export interface SheikhInfo {
    name: string;
    bio: string[];
    location: string;
    birth: string;
    email: string;
    phone: string;
    image: string;
    twitter: string;
}

const sheikh: SheikhInfo = {
    name: "الشيخ محمد بن رمزان الهاجري",
    twitter: "Moh1Rz2H3",
    bio: [
        "الشيخ محمد بن رمزان آل طامي الهاجري، من مواليد مدينة الجبيل في المنطقة الشرقية بالمملكة العربية السعودية.",
        "حصل على درجة الماجستير في الفقه من جامعة الإمام محمد بن سعود الإسلامية بالرياض.",
        "تتلمذ على يد عدد من كبار علماء أهل السنة، منهم الشيخ عبد العزيز بن باز، والشيخ محمد بن صالح العثيمين، والشيخ محمد أمان الجامي، والشيخ ربيع بن هادي المدخلي، والشيخ صالح الأطرم، والشيخ حماد الأنصاري.",
        "له دروس علمية مستمرة منذ سنوات، شملت شرح كتب مثل: عمدة الأحكام، الأربعين النووية، القواعد الأربع، الأصول الثلاثة، كتاب التوحيد، كشف الشبهات، الأصول الستة، الواسطية، الطحاوية، لمعة الاعتقاد، شرح السنة للبربهاري، الإبانة الصغرى، مسائل الجاهلية، فضل الإسلام، مختصر زاد المعاد، الرحبية، الورقات، البيقونية، كتاب العبادات من منهج السالكين، الملخص الفقهي للشيخ صالح الفوزان، الدروس المهمة لعامة الأمة لابن باز، الأصول من علم الأصول لابن عثيمين، وشيء من كتاب روضة الناظر.",
        "يقدم دروسًا أسبوعية في عدة مساجد بالجبيل والدمام، ويشارك في دورات علمية داخل المملكة وخارجها، منها المغرب، تركيا، أوروبا، الهند، بنغلاديش، سريلانكا، سلطنة عمان، والإمارات.",
        "نال تزكيات من عدد من العلماء، منهم الشيخ أحمد بن يحيى النجمي، الذي وصفه بأنه 'من رؤوس أهل السنة'، والشيخ عبيد الجابري، الذي أحال عليه السائلين من الجبيل."
    ],
    location: "الجبيل، المنطقة الشرقية، المملكة العربية السعودية",
    birth: "تاريخ الميلاد غير متوفر",
    email: "contact@sheikh-name.com",
    phone: "+966 12 345 6789",
    image: "/logo.png"
};

export default sheikh;
